SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-61700

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( DR_BR_V4_61700.s )
Size  ( 2.75996m 4.16307m 11.75657m )
Mass ( 70.4t-uk )comment(82.7.1UKT Empty, 93.1UKT Full)
WheelRadius ( 19in )comment (Front Bogie)

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Comment(Stiffness ( 1e7N/m 1e7N/m ))
			Comment(Damping ( 0.2e7N/m 0.2e7N/m ))
			Break ( 710kN 1220kN )
			r0 ( 15cm 0cm )
		)
		CouplingHasRigidConnection (1)
		Comment(Velocity (0.1m/s))
		Comment(CouplingUniqueType (DR_BR_8P_71000))
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Comment(Stiffness ( 1e6N/m 2e6N/m ))
			Comment(Damping ( 1e6N/m 1e6N/m ))
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	CouplingHasRigidConnection (0)
	Comment(Velocity (-0.1m/s))
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
BrakeEquipmentType( Vacuum_brake, Auxilary_reservoir )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 193kN )   Comment (* braked at 70% of mass on driving wheels 65.5t, coefficient of friction 0.5 *)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )

ORTSNumberBrakeCylinders ( 2 )
Comment ( Assume 1 x 30in vacuum cylinder with 9in stroke )
Comment ( OpenRails assumes 4.5in stroke so this is set as two cylinders )
ORTSBrakeCylinderSize ( 30in )
ORTSAuxilaryResCapacity ( 8.25ft^3 ) Comment ( Based on Phillipson 16.5ft^3 vacuum chamber for 30in x 9in vacuum cylinder )

Brakepipevolume (1.29ft^3 ) Comment (* based on length of loco plus 16 feet for bends, branches and hoses *)
MaxReleaseRate ( 2.5inHg/s ) 
Comment ( use MaxReleaseRate ( 10inHg/s ) for steam braked class V2; MaxReleaseRate ( 2.5inHg/s )for vacuum braked class V2 )
MaxApplicationRate ( 2.0inHg/s )
Comment ( use MaxApplicationRate ( 1.3inHg/s ) for steam braked class V2; MaxApplicationRate ( 2.0inHg/s )for vacuum braked class V2 )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.8m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 13.0ft 6.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 5500 )
ORTSDavis_B ( 23.54 )
ORTSDavis_C ( 5.289 )

ORTSWagonFrontalArea (99)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights	( 4
			Light	(
			comment( Front White Lamp Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 ) Service ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( 1.0 1.49 5.55 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.55 )
					)
				)
			)
			Light	(
			comment( Front White Lamp Position D )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 ) Service ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( cddddddd )
					Position ( -1.0 1.49 5.55 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.55 )
					)
				)
			)
			Light	(
			comment( Front Red Lamp Position B )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 4 ) Service ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( ccff4040 )
					Position ( 1.0 1.49 5.55 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.55 )
					)
				)
			)
			Light	(
			comment( Front Red Lamp Position D )
			Type		( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 4 ) Service ( 2 )
					)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	(	1
			State	(
					Duration ( 0.05 )
					LightColour ( ccff4040 )
					Position ( -1.0 1.49 5.55 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.55 )
					)
				)
			)
		)
	
Comment( ******* Miscellaneous Wagon Information************ )


Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( DR_BR_V4_61700.s )
        PassengerCabinHeadPos ( 1.423 3.0 -3.7 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound ("..\\..\\Common.Steam\\V2Sound\\V2eng.sms" )
)

Engine ( OR-61700

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				0.0 3.85 -3.881
				0 1 0
				0.15
			)

			SafetyValvesFX
			(
				0 3.931 -3.3
				0 1 0
				0.2
			)
			SafetyValvesFX
			(
				0 3.931 -3.35
				0 1 0
				0.35
			)
			StackFX
			(
				0 4.160 3.463
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.160 3.463
				0 1 0
				0.25
			)
			StackFX
			(
				0 4.160 3.463
				0 1 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)
			
			Injectors2FX
			(
				-1.36 -1 -4.7
				0 -1 0
				0.15
			)
			Injectors1FX
			(
				1.36 1 -4.7
				0 -1 0
				0.13
			)
      		Comment ( == Cylinder - Right Front== )
			CylindersFX
			(
				-1.074 0.505 5.3
				0 0 1
				0.17
			)
      		Comment ( == Cylinder - Right Rear== )
			Cylinders2FX
			(
				-1.074 0.495 5.3
				0 0 1
				0.17
			)
      		Comment ( == Cylinder - Centre Front== )
			CylindersFX
			(
				0 0.505 5.3
				0 0 1
				0.17
			)
      		Comment ( == Cylinder - Centre Rear== )
			Cylinders2FX
			(
				0 0.495 5.3
				0 0 1
				0.17
			)
      		Comment ( == Cylinder - Left Front== )
			CylindersFX
			(
				1.074 0.505 5.3
				0 0 1
				0.17
			)
      		Comment ( == Cylinder - Left Rear == )
			Cylinders2FX
			(
				1.074 0.495 5.3
				0 0 1
				0.17
			)
		)
	)

Wagon ( OR-61700 )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 34in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 51t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 238ft^3 )  
ORTSEvaporationArea ( 1799.9ft^2 )
ORTSSuperheatArea ( 355.8ft^2 )
MaxBoilerPressure ( 250psi )
MaxSteamHeatingPressure ( 60psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 3 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 15in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 28.5ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

MaxTenderCoalMass ( 8t-uk )
MaxTenderWaterMass ( 50000lb )
IsTenderRequired( 1 )	

ORTSWaterScoopFillElevation ( 2.8m )
ORTSWaterScoopDepth ( 3.0in ) Comment (* LNER standard scoop - depth varies depending on trough and area of operation *)
ORTSWaterScoopWidth ( 10.875in )


Comment(       ********ADVANCED PARAMETERS**********      )

Comment(ORTSMaxIndicatedHorsepower ( 1595.0hp ))   

ORTSMaxSuperheatTemperature ( 300.0 )   

ORTSBoilerEfficiency( 0.0 0.93  170.0 0.465 )   
Comment(From Report)

ORTSBurnRate( 0.0 10.0   12000.0 1430.0   14000.0 1725.0   18000.0 2350.0   22000.0 3110.0   26000.0 4030.0   30000.0 5270.0   31000.0 5760.0  33000.0 8640 )   
Comment(From Report)

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
ORTSBrakePipeTimeFactor ( 0.03s )
TrainPipeLeakRate ( 0.03inHg/s )


Comment ( *** Ejectors *** )
Comment (* Estimate for Davies & Metcalfe Type VB ejector *)
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.32inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 240lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 90psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakeEmergencyTimeFactor ( 5s )


Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
          Notch(0    0 TrainBrakesControllerReleaseStart )
          Notch(0.1  0 TrainBrakesControllerRunningStart )
          Notch(0.2  1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

ORTSSmallEjector( 0 1 0.1 0.55 )

FireDoor ( 0 1 0.1 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( V4.cvf )
HeadOut (  -1.423 3.0 -3.7 )
Sound ("..\\..\\Common.Steam\\V2Sound\\V2cab.sms" )
Name ( "61700 V4 Gresley, BANTAM COCK, Reverse Cab, TE 27.4Klbf" )
Description (
"Only two V4s were built. No. 3401 had a conventional firebox, whilst No. 3402 had the thermic syphon from the original design. Stays on No. 3402's copper firebox kept breaking, so it was quickly decided to replace the entire firebox including the thermic syphon. Hence from 1945, No. 3402 had a boiler and firebox to the same design as No. 3401.\n"+
"\n"+
"Gresley died shortly after No. 3402 was completed, and there is no evidence of advance orders for parts for further V4s. Instead of developing the V4, Thompson developed the simpler B1 which had a similar tractive effort.\n"+
"\n"+
"No. 3401 was named 'Bantam Cock' to highlight the lightweight nature of the design. No. 3402 was never given an official name, but acquired the popular name of 'Bantam Hen'. Under the 1946 renumbering, Nos. 3401 and 3402, became Nos. 1700 and 1701, respectively.\n"+
"\n"+
"After trials in the Leeds/York area and in East Anglia, both V4s moved to Scotland where they worked passenger services in and around Edinburgh before moving to the Glasgow - Fort William line in 1943. They were found to be best on the faster stretches of this line, but the K4s were more sure-footed on the steeper gradients. In 1949, they were replaced by B1 4-6-0s and Stanier 4-6-0 ,Black Fives'. They then moved to Eastfield, and operated goods trains to Edinburgh, Perth, and Kinross. Occasionally they worked passenger services in the 1950s, and for a while No. 61700 (LNER No. 3401) was based at Stirling shed specifically for passenger services.\n"+
"\n"+
"In 1954, they both moved Aberdeen to replace O7 WD 'Austerity' locomotives which were unsuitable for the required fast running. Both V4s were withdrawn in 1957."
)
)
